experiments/bench_results/eval_official_wl/bench.log

RUNS=4
SKIP_FIRST=1
MODEL=/workspace/MiniCPM5-2B
SERVED_MODEL_NAME=minicpm
PORT=9031
ENABLE_ALL=False
TOTAL_CASES=2
TEST_CASES=[(4096, 1024, 64, 256), (16384, 1024, 64, 128)]

================================================================================
Running: 4096_1024_c64 | Run 1/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256

INFO 09-24 11:08:04 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-24 11:08:04 [__init__.py:46] - fl -> vllm_fl:register
INFO 09-24 11:08:04 [__init__.py:58] Loading plugin fl
/opt/conda/envs/mx/lib/python3.12/site-packages/torch/library.py:381: UserWarning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: _C::cutlass_scaled_mm_supports_fp8(int cuda_device_capability) -> bool
    registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
  dispatch key: CompositeImplicitAutograd
  previous kernel: registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
       new kernel: registered at /dev/null:95 (Triggered internally at /workspace/framework/mcPytorch/aten/src/ATen/core/dispatch/OperatorEntry.cpp:218.)
  self.m.impl(
INFO Print the version information of mcoplib during compilation.

Version info:Mcoplib_Version = '0.4.5'
Build_Maca_Version = '3.7.0.37'
GIT_BRANCH = 'HEAD'
GIT_COMMIT = 'a9125e4'
Vllm Op Version = 0.20.0
SGlang Op Version  = 0.5.10 

INFO Staring Check the current MACA version of the operating environment.

INFO: Release major.minor matching,  successful:3.7. 

INFO 09-24 11:08:32 [__init__.py:237] Platform plugin fl is activated
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f4fafe06fc0>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=9031, endpoint='/v1/completions', header=None, max_concurrency=64, model='minicpm', input_len=None, output_len=None, tokenizer='/workspace/MiniCPM5-2B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-e3b03284-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-24 11:08:39 [utils.py:90] Sampling input_len from [4095, 4095] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [00:35<2:32:47, 35.95s/it]
  1%|          | 2/256 [00:36<1:02:56, 14.87s/it]
  1%|          | 3/256 [00:36<34:22,  8.15s/it]  
  2%|▏         | 4/256 [00:36<21:02,  5.01s/it]
  2%|▏         | 5/256 [00:36<13:40,  3.27s/it]
  2%|▏         | 6/256 [00:36<09:15,  2.22s/it]
  3%|▎         | 7/256 [00:36<06:27,  1.56s/it]
  3%|▎         | 8/256 [00:37<04:38,  1.12s/it]
  4%|▎         | 9/256 [00:37<03:24,  1.21it/s]
  4%|▍         | 10/256 [00:37<02:35,  1.58it/s]
  4%|▍         | 11/256 [00:37<02:01,  2.01it/s]
  5%|▍         | 12/256 [00:37<01:38,  2.48it/s]
  5%|▌         | 13/256 [00:38<01:22,  2.95it/s]
  5%|▌         | 14/256 [00:38<01:10,  3.41it/s]
  6%|▌         | 15/256 [00:38<01:03,  3.81it/s]
  6%|▋         | 16/256 [00:38<00:57,  4.17it/s]
  7%|▋         | 17/256 [00:38<00:53,  4.44it/s]
  7%|▋         | 18/256 [00:39<00:51,  4.65it/s]
  7%|▋         | 19/256 [00:39<00:49,  4.81it/s]
  8%|▊         | 20/256 [00:39<00:47,  4.93it/s]
  8%|▊         | 21/256 [00:39<00:46,  5.05it/s]
  9%|▊         | 22/256 [00:39<00:45,  5.12it/s]
  9%|▉         | 23/256 [00:39<00:44,  5.19it/s]
  9%|▉         | 24/256 [00:40<00:44,  5.22it/s]
 10%|▉         | 25/256 [00:40<00:43,  5.26it/s]
 10%|█         | 26/256 [00:40<00:43,  5.24it/s]
 11%|█         | 27/256 [00:40<00:43,  5.28it/s]
 11%|█         | 28/256 [00:40<00:43,  5.28it/s]
 11%|█▏        | 29/256 [00:41<00:42,  5.29it/s]
 12%|█▏        | 30/256 [00:41<00:42,  5.28it/s]
 12%|█▏        | 31/256 [00:41<00:42,  5.28it/s]
 12%|█▎        | 32/256 [00:41<00:42,  5.29it/s]
 13%|█▎        | 33/256 [00:41<00:42,  5.26it/s]
 13%|█▎        | 34/256 [00:42<00:42,  5.25it/s]
 14%|█▎        | 35/256 [00:42<00:42,  5.26it/s]
 14%|█▍        | 36/256 [00:42<00:41,  5.33it/s]
 14%|█▍        | 37/256 [00:42<00:40,  5.35it/s]
 15%|█▍        | 38/256 [00:42<00:40,  5.32it/s]
 15%|█▌        | 39/256 [00:43<00:40,  5.34it/s]
 16%|█▌        | 40/256 [00:43<00:40,  5.34it/s]
 16%|█▌        | 41/256 [00:43<00:40,  5.35it/s]
 16%|█▋        | 42/256 [00:43<00:39,  5.36it/s]
 17%|█▋        | 43/256 [00:43<00:39,  5.36it/s]
 17%|█▋        | 44/256 [00:43<00:39,  5.35it/s]
 18%|█▊        | 45/256 [00:44<00:39,  5.35it/s]
 18%|█▊        | 46/256 [00:44<00:45,  4.60it/s]
 18%|█▊        | 47/256 [00:44<00:43,  4.80it/s]
 19%|█▉        | 48/256 [00:44<00:42,  4.93it/s]
 19%|█▉        | 49/256 [00:44<00:41,  5.04it/s]
 20%|█▉        | 50/256 [00:45<00:40,  5.11it/s]
 20%|█▉        | 51/256 [00:45<00:39,  5.16it/s]
 20%|██        | 52/256 [00:45<00:38,  5.26it/s]
 21%|██        | 53/256 [00:45<00:38,  5.30it/s]
 21%|██        | 54/256 [00:45<00:38,  5.31it/s]
 21%|██▏       | 55/256 [00:46<00:37,  5.33it/s]
 22%|██▏       | 56/256 [00:46<00:37,  5.34it/s]
 22%|██▏       | 57/256 [00:46<00:37,  5.35it/s]
 23%|██▎       | 58/256 [00:46<00:36,  5.37it/s]
 23%|██▎       | 59/256 [00:46<00:36,  5.38it/s]
 23%|██▎       | 60/256 [00:47<00:36,  5.33it/s]
 24%|██▍       | 61/256 [00:47<00:36,  5.33it/s]
 24%|██▍       | 62/256 [00:47<00:36,  5.35it/s]
 25%|██▍       | 63/256 [00:47<00:36,  5.34it/s]
 25%|██▌       | 64/256 [00:47<00:35,  5.33it/s]
 25%|██▌       | 65/256 [01:12<24:29,  7.69s/it]
 26%|██▌       | 67/256 [01:13<13:10,  4.18s/it]
 27%|██▋       | 68/256 [01:13<10:00,  3.19s/it]
 27%|██▋       | 69/256 [01:13<07:30,  2.41s/it]
 27%|██▋       | 70/256 [01:13<05:35,  1.80s/it]
 28%|██▊       | 71/256 [01:13<04:10,  1.35s/it]
 28%|██▊       | 72/256 [01:14<03:07,  1.02s/it]
 29%|██▊       | 73/256 [01:14<02:22,  1.28it/s]
 29%|██▉       | 74/256 [01:14<01:50,  1.65it/s]
 29%|██▉       | 75/256 [01:14<01:27,  2.07it/s]
 30%|██▉       | 76/256 [01:14<01:11,  2.52it/s]
 30%|███       | 77/256 [01:15<00:59,  2.98it/s]
 30%|███       | 78/256 [01:15<00:51,  3.42it/s]
 31%|███       | 79/256 [01:15<00:46,  3.83it/s]
 31%|███▏      | 80/256 [01:15<00:42,  4.18it/s]
 32%|███▏      | 81/256 [01:15<00:43,  3.99it/s]
 32%|███▏      | 82/256 [01:16<00:40,  4.30it/s]
 32%|███▏      | 83/256 [01:16<00:38,  4.54it/s]
 33%|███▎      | 84/256 [01:16<00:36,  4.73it/s]
 33%|███▎      | 85/256 [01:16<00:34,  4.89it/s]
 34%|███▎      | 86/256 [01:16<00:33,  5.01it/s]
 34%|███▍      | 87/256 [01:17<00:33,  5.11it/s]
 34%|███▍      | 88/256 [01:17<00:32,  5.18it/s]
 35%|███▍      | 89/256 [01:17<00:31,  5.24it/s]
 35%|███▌      | 90/256 [01:17<00:31,  5.27it/s]
 36%|███▌      | 91/256 [01:17<00:31,  5.28it/s]
 36%|███▌      | 92/256 [01:17<00:30,  5.29it/s]
 36%|███▋      | 93/256 [01:18<00:30,  5.30it/s]
 37%|███▋      | 94/256 [01:18<00:30,  5.30it/s]
 37%|███▋      | 95/256 [01:18<00:30,  5.29it/s]
 38%|███▊      | 96/256 [01:18<00:30,  5.29it/s]
 38%|███▊      | 97/256 [01:19<00:34,  4.66it/s]
 38%|███▊      | 98/256 [01:19<00:32,  4.82it/s]
 39%|███▊      | 99/256 [01:19<00:31,  4.95it/s]
 39%|███▉      | 100/256 [01:19<00:30,  5.04it/s]
 39%|███▉      | 101/256 [01:19<00:30,  5.12it/s]
 40%|███▉      | 102/256 [01:19<00:29,  5.17it/s]
 40%|████      | 103/256 [01:20<00:29,  5.23it/s]
 41%|████      | 104/256 [01:20<00:28,  5.26it/s]
 41%|████      | 105/256 [01:20<00:28,  5.29it/s]
 41%|████▏     | 106/256 [01:20<00:28,  5.31it/s]
 42%|████▏     | 107/256 [01:20<00:28,  5.30it/s]
 42%|████▏     | 108/256 [01:21<00:27,  5.32it/s]
 43%|████▎     | 109/256 [01:21<00:27,  5.32it/s]
 43%|████▎     | 110/256 [01:21<00:27,  5.31it/s]
 43%|████▎     | 111/256 [01:21<00:27,  5.31it/s]
 44%|████▍     | 112/256 [01:21<00:27,  5.30it/s]
 44%|████▍     | 113/256 [01:22<00:30,  4.69it/s]
 45%|████▍     | 114/256 [01:22<00:29,  4.86it/s]
 45%|████▍     | 115/256 [01:22<00:28,  4.98it/s]
 45%|████▌     | 116/256 [01:22<00:27,  5.07it/s]
 46%|████▌     | 117/256 [01:22<00:26,  5.15it/s]
 46%|████▌     | 118/256 [01:23<00:26,  5.20it/s]
 46%|████▋     | 119/256 [01:23<00:26,  5.25it/s]
 47%|████▋     | 120/256 [01:23<00:25,  5.28it/s]
 47%|████▋     | 121/256 [01:23<00:25,  5.32it/s]
 48%|████▊     | 122/256 [01:23<00:25,  5.35it/s]
 48%|████▊     | 123/256 [01:23<00:24,  5.33it/s]
 48%|████▊     | 124/256 [01:24<00:24,  5.33it/s]
 49%|████▉     | 125/256 [01:24<00:24,  5.34it/s]
 49%|████▉     | 126/256 [01:24<00:24,  5.33it/s]
 50%|████▉     | 127/256 [01:24<00:24,  5.32it/s]
 50%|█████     | 128/256 [01:24<00:24,  5.33it/s]
 50%|█████     | 129/256 [01:49<16:02,  7.58s/it]
 51%|█████     | 131/256 [01:49<08:37,  4.14s/it]
 52%|█████▏    | 132/256 [01:50<06:31,  3.16s/it]
 52%|█████▏    | 133/256 [01:50<04:52,  2.38s/it]
 52%|█████▏    | 134/256 [01:50<03:37,  1.78s/it]
 53%|█████▎    | 135/256 [01:50<02:41,  1.34s/it]
 53%|█████▎    | 136/256 [01:50<02:01,  1.01s/it]
 54%|█████▎    | 137/256 [01:51<01:31,  1.30it/s]
 54%|█████▍    | 138/256 [01:51<01:10,  1.67it/s]
 54%|█████▍    | 139/256 [01:51<00:56,  2.09it/s]
 55%|█████▍    | 140/256 [01:51<00:45,  2.54it/s]
 55%|█████▌    | 141/256 [01:51<00:38,  3.01it/s]
 55%|█████▌    | 142/256 [01:52<00:33,  3.45it/s]
 56%|█████▌    | 143/256 [01:52<00:29,  3.85it/s]
 56%|█████▋    | 144/256 [01:52<00:26,  4.20it/s]
 57%|█████▋    | 145/256 [01:52<00:28,  3.90it/s]
 57%|█████▋    | 146/256 [01:52<00:25,  4.25it/s]
 57%|█████▋    | 147/256 [01:53<00:23,  4.55it/s]
 58%|█████▊    | 148/256 [01:53<00:22,  4.77it/s]
 58%|█████▊    | 149/256 [01:53<00:21,  4.92it/s]
 59%|█████▊    | 150/256 [01:53<00:21,  5.04it/s]
 59%|█████▉    | 151/256 [01:53<00:20,  5.14it/s]
 59%|█████▉    | 152/256 [01:54<00:19,  5.21it/s]
 60%|█████▉    | 153/256 [01:54<00:19,  5.26it/s]
 60%|██████    | 154/256 [01:54<00:19,  5.27it/s]
 61%|██████    | 155/256 [01:54<00:19,  5.29it/s]
 61%|██████    | 156/256 [01:54<00:18,  5.30it/s]
 61%|██████▏   | 157/256 [01:54<00:18,  5.29it/s]
 62%|██████▏   | 158/256 [01:55<00:18,  5.30it/s]
 62%|██████▏   | 159/256 [01:55<00:18,  5.29it/s]
 62%|██████▎   | 160/256 [01:55<00:18,  5.31it/s]
 63%|██████▎   | 161/256 [01:55<00:21,  4.52it/s]
 63%|██████▎   | 162/256 [01:56<00:19,  4.74it/s]
 64%|██████▎   | 163/256 [01:56<00:18,  4.95it/s]
 64%|██████▍   | 164/256 [01:56<00:18,  5.07it/s]
 64%|██████▍   | 165/256 [01:56<00:17,  5.15it/s]
 65%|██████▍   | 166/256 [01:56<00:17,  5.20it/s]
 65%|██████▌   | 167/256 [01:56<00:16,  5.25it/s]
 66%|██████▌   | 168/256 [01:57<00:16,  5.29it/s]
 66%|██████▌   | 169/256 [01:57<00:16,  5.31it/s]
 66%|██████▋   | 170/256 [01:57<00:16,  5.32it/s]
 67%|██████▋   | 171/256 [01:57<00:15,  5.32it/s]
 67%|██████▋   | 172/256 [01:57<00:15,  5.33it/s]
 68%|██████▊   | 173/256 [01:58<00:15,  5.32it/s]
 68%|██████▊   | 174/256 [01:58<00:15,  5.31it/s]
 68%|██████▊   | 175/256 [01:58<00:15,  5.32it/s]
 69%|██████▉   | 176/256 [01:58<00:15,  5.32it/s]
 69%|██████▉   | 177/256 [01:58<00:17,  4.53it/s]
 70%|██████▉   | 178/256 [01:59<00:16,  4.76it/s]
 70%|██████▉   | 179/256 [01:59<00:15,  4.97it/s]
 70%|███████   | 180/256 [01:59<00:14,  5.08it/s]
 71%|███████   | 181/256 [01:59<00:14,  5.16it/s]
 71%|███████   | 182/256 [01:59<00:14,  5.21it/s]
 71%|███████▏  | 183/256 [02:00<00:13,  5.26it/s]
 72%|███████▏  | 184/256 [02:00<00:13,  5.29it/s]
 72%|███████▏  | 185/256 [02:00<00:13,  5.31it/s]
 73%|███████▎  | 186/256 [02:00<00:13,  5.32it/s]
 73%|███████▎  | 187/256 [02:00<00:12,  5.32it/s]
 73%|███████▎  | 188/256 [02:00<00:12,  5.33it/s]
 74%|███████▍  | 189/256 [02:01<00:12,  5.32it/s]
 74%|███████▍  | 190/256 [02:01<00:12,  5.33it/s]
 75%|███████▍  | 191/256 [02:01<00:12,  5.33it/s]
 75%|███████▌  | 192/256 [02:01<00:11,  5.78it/s]
 75%|███████▌  | 193/256 [02:26<07:58,  7.59s/it]
 76%|███████▌  | 195/256 [02:26<04:10,  4.11s/it]
 77%|███████▋  | 197/256 [02:26<02:27,  2.50s/it]
 78%|███████▊  | 199/256 [02:26<01:32,  1.61s/it]
 79%|███████▊  | 201/256 [02:27<00:59,  1.08s/it]
 79%|███████▉  | 203/256 [02:27<00:39,  1.34it/s]
 80%|████████  | 206/256 [02:27<00:22,  2.19it/s]
 82%|████████▏ | 209/256 [02:27<00:14,  3.24it/s]
 83%|████████▎ | 212/256 [02:27<00:09,  4.60it/s]
 84%|████████▍ | 215/256 [02:27<00:06,  6.25it/s]
 85%|████████▌ | 218/256 [02:27<00:04,  8.18it/s]
 86%|████████▋ | 221/256 [02:27<00:03, 10.36it/s]
 88%|████████▊ | 224/256 [02:28<00:02, 12.70it/s]
 89%|████████▊ | 227/256 [02:28<00:01, 14.80it/s]
 90%|████████▉ | 230/256 [02:28<00:01, 17.34it/s]
 91%|█████████▏| 234/256 [02:28<00:01, 20.59it/s]
 93%|█████████▎| 238/256 [02:28<00:00, 23.57it/s]
 94%|█████████▍| 241/256 [02:28<00:00, 25.01it/s]
 96%|█████████▌| 245/256 [02:28<00:00, 28.39it/s]
 98%|█████████▊| 250/256 [02:28<00:00, 32.21it/s]
100%|█████████▉| 255/256 [02:28<00:00, 36.30it/s]
100%|██████████| 256/256 [02:28<00:00,  1.72it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  148.98    
Total input tokens:                      1048576   
Total generated tokens:                  262144    
Request throughput (req/s):              1.72      
Output token throughput (tok/s):         1759.53   
Peak output token throughput (tok/s):    2432.00   
Peak concurrent requests:                70.00     
Total token throughput (tok/s):          8797.67   
---------------Time to First Token----------------
Mean TTFT (ms):                          1819.48   
Median TTFT (ms):                        565.47    
P99 TTFT (ms):                           10873.52  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          34.38     
Median TPOT (ms):                        35.42     
P99 TPOT (ms):                           35.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           34.38     
Median ITL (ms):                         27.26     
P99 ITL (ms):                            103.72    
==================================================

================================================================================
Running: 4096_1024_c64 | Run 2/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256

INFO 09-24 11:11:37 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 09-24 11:11:37 [__init__.py:46] - fl -> vllm_fl:register
INFO 09-24 11:11:37 [__init__.py:58] Loading plugin fl
/opt/conda/envs/mx/lib/python3.12/site-packages/torch/library.py:381: UserWarning: Warning only once for all operators,  other operators may also be overridden.
  Overriding a previously registered kernel for the same operator and the same dispatch key
  operator: _C::cutlass_scaled_mm_supports_fp8(int cuda_device_capability) -> bool
    registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
  dispatch key: CompositeImplicitAutograd
  previous kernel: registered at /tmp/build-via-sdist-_ouj1d45/mcoplib-0.4.5+maca3.7.0.37.torch2.8/op/vllm/torch_bindings.cpp:26
       new kernel: registered at /dev/null:95 (Triggered internally at /workspace/framework/mcPytorch/aten/src/ATen/core/dispatch/OperatorEntry.cpp:218.)
  self.m.impl(
INFO Print the version information of mcoplib during compilation.

Version info:Mcoplib_Version = '0.4.5'
Build_Maca_Version = '3.7.0.37'
GIT_BRANCH = 'HEAD'
GIT_COMMIT = 'a9125e4'
Vllm Op Version = 0.20.0
SGlang Op Version  = 0.5.10 

INFO Staring Check the current MACA version of the operating environment.

INFO: Release major.minor matching,  successful:3.7. 

INFO 09-24 11:12:05 [__init__.py:237] Platform plugin fl is activated
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/datapoints/__init__.py:12: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
/opt/conda/envs/mx/lib/python3.12/site-packages/torchvision/transforms/v2/__init__.py:54: UserWarning: The torchvision.datapoints and torchvision.transforms.v2 namespaces are still Beta. While we do not expect major breaking changes, some APIs may still change according to user feedback. Please submit any feedback you may have in this issue: https://github.com/pytorch/vision/issues/6753, and you can also check out https://github.com/pytorch/vision/issues/7319 to learn more about the APIs that we suspect might involve future changes. You can silence this warning by calling torchvision.disable_beta_transforms_warning().
  warnings.warn(_BETA_TRANSFORMS_WARNING)
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f8cd278f100>, trust_remote_code=False, seed=0, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=1024, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='localhost', port=9031, endpoint='/v1/completions', header=None, max_concurrency=64, model='minicpm', input_len=None, output_len=None, tokenizer='/workspace/MiniCPM5-2B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-0fc829cf-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-24 11:12:11 [utils.py:90] Sampling input_len from [4095, 4095] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64

  0%|          | 0/256 [00:00<?, ?it/s]
  0%|          | 1/256 [00:35<2:31:58, 35.76s/it]
  1%|          | 2/256 [00:35<1:02:35, 14.79s/it]
  1%|          | 3/256 [00:36<34:11,  8.11s/it]  
  2%|▏         | 4/256 [00:36<20:55,  4.98s/it]
  2%|▏         | 5/256 [00:36<13:36,  3.25s/it]
  2%|▏         | 6/256 [00:36<09:13,  2.21s/it]
  3%|▎         | 7/256 [00:36<06:26,  1.55s/it]
  3%|▎         | 8/256 [00:36<04:37,  1.12s/it]
  4%|▎         | 9/256 [00:37<03:24,  1.21it/s]
  4%|▍         | 10/256 [00:37<02:34,  1.59it/s]
  4%|▍         | 11/256 [00:37<02:01,  2.02it/s]
  5%|▍         | 12/256 [00:37<01:38,  2.49it/s]
  5%|▌         | 13/256 [00:37<01:22,  2.96it/s]
  5%|▌         | 14/256 [00:38<01:06,  3.63it/s]
  6%|▌         | 15/256 [00:38<00:58,  4.09it/s]
  6%|▋         | 16/256 [00:38<00:54,  4.39it/s]
  7%|▋         | 17/256 [00:38<00:51,  4.64it/s]
  7%|▋         | 18/256 [00:38<00:49,  4.81it/s]
  7%|▋         | 19/256 [00:38<00:47,  4.95it/s]
  8%|▊         | 20/256 [00:39<00:46,  5.04it/s]
  8%|▊         | 21/256 [00:39<00:45,  5.12it/s]
  9%|▊         | 22/256 [00:39<00:45,  5.15it/s]
  9%|▉         | 23/256 [00:39<00:44,  5.19it/s]
  9%|▉         | 24/256 [00:39<00:44,  5.20it/s]
 10%|▉         | 25/256 [00:40<00:44,  5.21it/s]
 10%|█         | 26/256 [00:40<00:43,  5.23it/s]
 11%|█         | 27/256 [00:40<00:43,  5.23it/s]
 11%|█         | 28/256 [00:40<00:43,  5.25it/s]
 11%|█▏        | 29/256 [00:40<00:43,  5.23it/s]
 12%|█▏        | 30/256 [00:41<00:43,  5.21it/s]
 12%|█▏        | 31/256 [00:41<00:43,  5.22it/s]
 12%|█▎        | 32/256 [00:41<00:42,  5.22it/s]
 13%|█▎        | 33/256 [00:41<00:42,  5.26it/s]
 13%|█▎        | 34/256 [00:41<00:42,  5.27it/s]
 14%|█▎        | 35/256 [00:42<00:42,  5.25it/s]
 14%|█▍        | 36/256 [00:42<00:41,  5.26it/s]
 15%|█▍        | 38/256 [00:42<00:31,  6.85it/s]
 15%|█▌        | 39/256 [00:42<00:34,  6.34it/s]
 16%|█▌        | 40/256 [00:42<00:35,  6.01it/s]
 16%|█▌        | 41/256 [00:42<00:37,  5.77it/s]
 16%|█▋        | 42/256 [00:43<00:38,  5.59it/s]
 17%|█▋        | 43/256 [00:43<00:38,  5.51it/s]
 17%|█▋        | 44/256 [00:43<00:39,  5.42it/s]
 18%|█▊        | 45/256 [00:43<00:39,  5.38it/s]
 18%|█▊        | 46/256 [00:43<00:39,  5.31it/s]
 18%|█▊        | 47/256 [00:44<00:44,  4.66it/s]
 19%|█▉        | 48/256 [00:44<00:43,  4.82it/s]
 19%|█▉        | 49/256 [00:44<00:42,  4.91it/s]
 20%|█▉        | 50/256 [00:44<00:41,  5.01it/s]
 20%|█▉        | 51/256 [00:44<00:40,  5.10it/s]
 20%|██        | 52/256 [00:45<00:39,  5.15it/s]
 21%|██        | 53/256 [00:45<00:39,  5.19it/s]
 21%|██        | 54/256 [00:45<00:38,  5.21it/s]
 21%|██▏       | 55/256 [00:45<00:38,  5.24it/s]
 22%|██▏       | 56/256 [00:45<00:38,  5.24it/s]
 22%|██▏       | 57/256 [00:46<00:37,  5.24it/s]
 23%|██▎       | 58/256 [00:46<00:37,  5.24it/s]
 23%|██▎       | 59/256 [00:46<00:37,  5.23it/s]
 23%|██▎       | 60/256 [00:46<00:37,  5.24it/s]
 24%|██▍       | 61/256 [00:46<00:37,  5.25it/s]
 24%|██▍       | 62/256 [00:47<00:36,  5.25it/s]
 25%|██▍       | 63/256 [00:47<00:36,  5.24it/s]
 25%|██▌       | 64/256 [00:47<00:36,  5.24it/s]
 25%|██▌       | 65/256 [01:12<24:35,  7.73s/it]
 26%|██▌       | 67/256 [01:12<13:13,  4.20s/it]
 27%|██▋       | 68/256 [01:13<10:02,  3.21s/it]
 27%|██▋       | 69/256 [01:13<07:31,  2.42s/it]
 27%|██▋       | 70/256 [01:13<05:36,  1.81s/it]
 28%|██▊       | 71/256 [01:13<04:11,  1.36s/it]
 28%|██▊       | 72/256 [01:13<03:08,  1.02s/it]
 29%|██▊       | 73/256 [01:14<02:22,  1.28it/s]
 29%|██▉       | 74/256 [01:14<01:50,  1.64it/s]
 29%|██▉       | 75/256 [01:14<01:27,  2.06it/s]
 30%|███       | 77/256 [01:14<01:02,  2.85it/s]
 30%|███       | 78/256 [01:15<00:55,  3.21it/s]
 31%|███       | 79/256 [01:15<00:49,  3.58it/s]
 31%|███▏      | 80/256 [01:15<00:44,  3.91it/s]
 32%|███▏      | 81/256 [01:15<00:41,  4.20it/s]
 32%|███▏      | 82/256 [01:15<00:39,  4.45it/s]
 32%|███▏      | 83/256 [01:15<00:37,  4.65it/s]
 33%|███▎      | 84/256 [01:16<00:35,  4.85it/s]
 33%|███▎      | 85/256 [01:16<00:34,  4.99it/s]
 34%|███▎      | 86/256 [01:16<00:33,  5.08it/s]
 34%|███▍      | 87/256 [01:16<00:32,  5.14it/s]
 34%|███▍      | 88/256 [01:16<00:32,  5.20it/s]
 35%|███▍      | 89/256 [01:17<00:31,  5.24it/s]
 35%|███▌      | 90/256 [01:17<00:31,  5.28it/s]
 36%|███▌      | 91/256 [01:17<00:31,  5.29it/s]
 36%|███▌      | 92/256 [01:17<00:30,  5.29it/s]
 36%|███▋      | 93/256 [01:17<00:35,  4.56it/s]
 37%|███▋      | 94/256 [01:18<00:34,  4.74it/s]
 37%|███▋      | 95/256 [01:18<00:32,  4.90it/s]
 38%|███▊      | 96/256 [01:18<00:32,  5.00it/s]
 38%|███▊      | 97/256 [01:18<00:31,  5.09it/s]
 38%|███▊      | 98/256 [01:18<00:30,  5.13it/s]
 39%|███▊      | 99/256 [01:19<00:30,  5.15it/s]
 39%|███▉      | 100/256 [01:19<00:29,  5.25it/s]
 39%|███▉      | 101/256 [01:19<00:29,  5.28it/s]
 40%|███▉      | 102/256 [01:19<00:29,  5.27it/s]
 40%|████      | 103/256 [01:19<00:28,  5.29it/s]
 41%|████      | 104/256 [01:20<00:28,  5.31it/s]
 41%|████      | 105/256 [01:20<00:28,  5.32it/s]
 41%|████▏     | 106/256 [01:20<00:28,  5.34it/s]
 42%|████▏     | 107/256 [01:20<00:27,  5.35it/s]
 42%|████▏     | 108/256 [01:20<00:27,  5.32it/s]
 43%|████▎     | 109/256 [01:21<00:32,  4.58it/s]
 43%|████▎     | 110/256 [01:21<00:30,  4.77it/s]
 43%|████▎     | 111/256 [01:21<00:29,  4.90it/s]
 44%|████▍     | 112/256 [01:21<00:28,  4.99it/s]
 44%|████▍     | 113/256 [01:21<00:28,  5.08it/s]
 45%|████▍     | 114/256 [01:22<00:27,  5.13it/s]
 45%|████▍     | 115/256 [01:22<00:27,  5.18it/s]
 45%|████▌     | 116/256 [01:22<00:26,  5.20it/s]
 46%|████▌     | 117/256 [01:22<00:26,  5.29it/s]
 46%|████▌     | 118/256 [01:22<00:25,  5.32it/s]
 46%|████▋     | 119/256 [01:22<00:25,  5.34it/s]
 47%|████▋     | 120/256 [01:23<00:25,  5.34it/s]
 47%|████▋     | 121/256 [01:23<00:25,  5.35it/s]
 48%|████▊     | 122/256 [01:23<00:25,  5.35it/s]
 48%|████▊     | 123/256 [01:23<00:24,  5.36it/s]
 48%|████▊     | 124/256 [01:23<00:24,  5.34it/s]
 49%|████▉     | 125/256 [01:24<00:24,  5.33it/s]
 49%|████▉     | 126/256 [01:24<00:28,  4.57it/s]
 50%|████▉     | 127/256 [01:24<00:26,  4.79it/s]
 50%|█████     | 128/256 [01:24<00:25,  4.94it/s]
 50%|█████     | 129/256 [01:49<16:12,  7.65s/it]
 51%|█████     | 131/256 [01:50<08:42,  4.18s/it]
 52%|█████▏    | 132/256 [01:50<06:35,  3.19s/it]
 52%|█████▏    | 133/256 [01:50<04:55,  2.40s/it]
 52%|█████▏    | 134/256 [01:50<03:39,  1.80s/it]
 53%|█████▎    | 135/256 [01:50<02:43,  1.35s/it]
 53%|█████▎    | 136/256 [01:50<02:02,  1.02s/it]
 54%|█████▎    | 137/256 [01:51<01:32,  1.28it/s]
 54%|█████▍    | 138/256 [01:51<01:11,  1.65it/s]
 54%|█████▍    | 139/256 [01:51<00:56,  2.07it/s]
 55%|█████▍    | 140/256 [01:51<00:46,  2.52it/s]
 55%|█████▌    | 141/256 [01:51<00:38,  2.98it/s]
 55%|█████▌    | 142/256 [01:52<00:33,  3.42it/s]
 56%|█████▌    | 143/256 [01:52<00:29,  3.82it/s]
 56%|█████▋    | 144/256 [01:52<00:26,  4.16it/s]
 57%|█████▋    | 145/256 [01:52<00:28,  3.87it/s]
 57%|█████▋    | 146/256 [01:52<00:26,  4.22it/s]
 57%|█████▋    | 147/256 [01:53<00:24,  4.53it/s]
 58%|█████▊    | 148/256 [01:53<00:22,  4.74it/s]
 58%|█████▊    | 149/256 [01:53<00:21,  4.90it/s]
 59%|█████▊    | 150/256 [01:53<00:21,  5.01it/s]
 59%|█████▉    | 151/256 [01:53<00:20,  5.11it/s]
 59%|█████▉    | 152/256 [01:54<00:20,  5.17it/s]
 60%|█████▉    | 153/256 [01:54<00:19,  5.22it/s]
 60%|██████    | 154/256 [01:54<00:19,  5.23it/s]
 61%|██████    | 155/256 [01:54<00:19,  5.25it/s]
 61%|██████    | 156/256 [01:54<00:18,  5.27it/s]
 61%|██████▏   | 157/256 [01:55<00:18,  5.26it/s]
 62%|██████▏   | 158/256 [01:55<00:18,  5.26it/s]
 62%|██████▏   | 159/256 [01:55<00:18,  5.26it/s]
 62%|██████▎   | 160/256 [01:55<00:18,  5.27it/s]
 63%|██████▎   | 161/256 [01:55<00:21,  4.49it/s]
 63%|██████▎   | 162/256 [01:56<00:19,  4.72it/s]
 64%|██████▎   | 163/256 [01:56<00:18,  4.91it/s]
 64%|██████▍   | 164/256 [01:56<00:18,  5.04it/s]
 64%|██████▍   | 165/256 [01:56<00:17,  5.12it/s]
 65%|██████▍   | 166/256 [01:56<00:17,  5.18it/s]
 65%|██████▌   | 167/256 [01:57<00:17,  5.22it/s]
 66%|██████▌   | 168/256 [01:57<00:16,  5.26it/s]
 66%|██████▌   | 169/256 [01:57<00:16,  5.28it/s]
 66%|██████▋   | 170/256 [01:57<00:16,  5.28it/s]
 67%|██████▋   | 171/256 [01:57<00:16,  5.28it/s]
 67%|██████▋   | 172/256 [01:57<00:15,  5.29it/s]
 68%|██████▊   | 173/256 [01:58<00:15,  5.27it/s]
 68%|██████▊   | 174/256 [01:58<00:15,  5.28it/s]
 68%|██████▊   | 175/256 [01:58<00:15,  5.26it/s]
 69%|██████▉   | 176/256 [01:58<00:15,  5.30it/s]
 69%|██████▉   | 177/256 [01:58<00:14,  5.27it/s]
 70%|██████▉   | 178/256 [01:59<00:17,  4.50it/s]
 70%|██████▉   | 179/256 [01:59<00:16,  4.76it/s]
 70%|███████   | 180/256 [01:59<00:15,  4.92it/s]
 71%|███████   | 181/256 [01:59<00:14,  5.04it/s]
 71%|███████   | 182/256 [01:59<00:14,  5.11it/s]
 71%|███████▏  | 183/256 [02:00<00:14,  5.18it/s]
 72%|███████▏  | 184/256 [02:00<00:13,  5.23it/s]
 72%|███████▏  | 185/256 [02:00<00:13,  5.27it/s]
 73%|███████▎  | 186/256 [02:00<00:13,  5.27it/s]
 73%|███████▎  | 187/256 [02:00<00:13,  5.27it/s]
 73%|███████▎  | 188/256 [02:01<00:12,  5.29it/s]
 74%|███████▍  | 189/256 [02:01<00:12,  5.31it/s]
 74%|███████▍  | 190/256 [02:01<00:12,  5.30it/s]
 75%|███████▍  | 191/256 [02:01<00:12,  5.32it/s]
 75%|███████▌  | 192/256 [02:01<00:11,  5.81it/s]
 75%|███████▌  | 193/256 [02:31<09:24,  8.96s/it]
 76%|███████▌  | 195/256 [02:31<04:55,  4.85s/it]
 77%|███████▋  | 197/256 [02:31<02:53,  2.94s/it]
 78%|███████▊  | 199/256 [02:31<01:48,  1.90s/it]
 79%|███████▊  | 201/256 [02:31<01:09,  1.27s/it]
 79%|███████▉  | 203/256 [02:31<00:46,  1.15it/s]
 80%|████████  | 206/256 [02:31<00:26,  1.88it/s]
 82%|████████▏ | 209/256 [02:32<00:16,  2.82it/s]
 83%|████████▎ | 212/256 [02:32<00:10,  4.04it/s]
 84%|████████▍ | 215/256 [02:32<00:07,  5.54it/s]
 85%|████████▌ | 218/256 [02:32<00:05,  7.35it/s]
 86%|████████▋ | 221/256 [02:32<00:03,  9.42it/s]
 88%|████████▊ | 224/256 [02:32<00:02, 11.70it/s]
 89%|████████▊ | 227/256 [02:32<00:02, 13.84it/s]
 90%|████████▉ | 230/256 [02:32<00:01, 16.43it/s]
 91%|█████████ | 233/256 [02:33<00:01, 19.04it/s]
 93%|█████████▎| 237/256 [02:33<00:00, 22.38it/s]
 94%|█████████▍| 241/256 [02:33<00:00, 24.70it/s]
 96%|█████████▌| 245/256 [02:33<00:00, 27.99it/s]
 98%|█████████▊| 250/256 [02:33<00:00, 31.80it/s]
100%|█████████▉| 255/256 [02:33<00:00, 35.91it/s]
100%|██████████| 256/256 [02:33<00:00,  1.67it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             64        
Benchmark duration (s):                  153.67    
Total input tokens:                      1048576   
Total generated tokens:                  262144    
Request throughput (req/s):              1.67      
Output token throughput (tok/s):         1705.88   
Peak output token throughput (tok/s):    3669.00   
Peak concurrent requests:                71.00     
Total token throughput (tok/s):          8529.41   
---------------Time to First Token----------------
Mean TTFT (ms):                          1816.86   
Median TTFT (ms):                        577.39    
P99 TTFT (ms):                           10797.14  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          35.53     
Median TPOT (ms):                        35.65     
P99 TPOT (ms):                           39.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           36.70     
Median ITL (ms):                         27.24     
P99 ITL (ms):                            105.57    
==================================================

================================================================================
Running: 4096_1024_c64 | Run 3/4
================================================================================
vllm bench serve --backend vllm --model minicpm --tokenizer /workspace/MiniCPM5-2B --endpoint /v1/completions --host localhost --port 9031 --dataset-name random --ignore-eos --random-input-len 4096 --random-output-len 1024 --max-concurrency 64 --num-prompts 256